In [1]:
import seaborn as sns
df = sns.load_dataset('titanic')

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
df['deck'].unique()

[NaN, 'C', 'E', 'G', 'D', 'A', 'B', 'F']
Categories (7, object): ['A', 'B', 'C', 'D', 'E', 'F', 'G']

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [3]:
# NaN 값을 조회
# deck: 데크 번호 (알파벳 + 숫자혼용)
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [8]:
# deck 열의 NaN 개수 계산기
nan_deck = df['deck'].value_counts(dropna=False)
print(nan_deck)

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

In [11]:
df.notnull().sum(axis=1)

0      14
1      15
2      14
3      15
4      14
       ..
886    14
887    15
888    13
889    15
890    14
Length: 891, dtype: int64

In [12]:
# 결측치 확인 for 반복문으로 각 열의 NaN 개수 계산
missing_df = df.isnull()
for col in missing_df.columns:
    missing_count = missing_df[col].value_counts()
    try:
        print(col, ':', missing_count[True]) # NaN값이 있으면 개수를 출력
    except:
        print(col, ":", missing_count[0]) # NaN값이 없으면 0 출력

survived : 891
pclass : 891
sex : 891
age : 177
sibsp : 891
parch : 891
fare : 891
embarked : 2
class : 891
who : 891
adult_male : 891
deck : 688
embark_town : 2
alive : 891
alone : 891

In [13]:
# NaN 값이 500개 이상인 열을 모두 삭제 - deck열(891개 중  688개 NaN)삭제
df_tresh = df.dropna(axis = 1, thresh = 500)
print(len(df_tresh.columns))
print(df_tresh.columns)

14
Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [15]:
# age 열에 나이데이터 없는 모든행을 삭제()
df_age = df.dropna(subset=['age'],how='type', axis=0)

ValueError: invalid how option: type

In [16]:
# age 열의 NaN값을 다른 나이 데이터의 평균으로 변경
mean_age = df['age'].mean(axis=0) # age열의 평균을 계산(NaN값을 제외)
df['age'].fillna(mean_age, inplace=True)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [19]:
# embark_town 승선지는 최빈값(가장 많이 출연한 값)
most_freq = df['embark_town'].value_counts(dropna=True).idxmax()
print(most_freq)

Southampton

In [22]:
df['embark_town'].fillna(most_freq, inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
# embark_town 승선지는 최빈값(가장 많이 출연한 값)
most_freq = df['embark_town'].value_counts(dropna=True).idxmax()
print(most_freq)
# most_freq = df['embark_town'][825:].value_counts(dropna=True).idxmax()

In [23]:
# embark 열의 NaN 값을 바로 앞에 있는 변경하기
df['embarked'].fillna(method='ffill', inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          891 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     891 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  891 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [25]:
import pandas as pd

In [26]:
# 중복 데이터를 갖는 데이터 찾기
df2 = pd.DataFrame({'c1':['a','a','b','a','b'],
                   'c2': [1,1,1,2,2],
                   'c3':[1,1,2,2,2]})
print(df2)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [27]:
df_dup = df.duplicated()
print(df_dup)

0      False
1      False
2      False
3      False
4      False
       ...
886     True
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

In [28]:
# 데이터 프레임의 특정열에서 데이터 중복 값을 찾기

In [31]:
# 데이터 프레임에서 중복 행 제거
df3 = df2.drop_duplicates()
print(df3)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [32]:
# c2, c3열을 기준으로 중복행 제거
df4 = df2.drop_duplicates(subset=['c2', 'c3'])
print(df4)

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

# 값 변환 conversion

In [36]:
df = pd.read_csv('./data1/auto-mpg.csv', header=None)
df.head()
df.columns = ['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
              'acceleration', 'model year', 'origin', 'name']
df.head()
# mpg (mile per gallon)를 kpl(kilometer per liter)을 생성(mpg_to_kpl = )
mpg_to_kpl = 1.60934 / 3.78541
# mpg 열에 0.425를 곱해서 새로운 kpl 컬럼을 생성
df['kpl'] = df['mpg'] * mpg_to_kpl
# kpl열을 소수점 아래 둘째자리 반올림
df['kpl'] = df['kpl'].round(2)
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name,kpl
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu,7.65
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320,6.38
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite,7.65

In [38]:
# 각 열의 자료형 확인
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower       object
weight          float64
acceleration    float64
model year        int64
origin            int64
name             object
kpl             float64
dtype: object

In [39]:
# hores 열의 고유값
print(df['horsepower'].unique())

['130.0' '165.0' '150.0' '140.0' '198.0' '220.0' '215.0' '225.0' '190.0'
 '170.0' '160.0' '95.00' '97.00' '85.00' '88.00' '46.00' '87.00' '90.00'
 '113.0' '200.0' '210.0' '193.0' '?' '100.0' '105.0' '175.0' '153.0'
 '180.0' '110.0' '72.00' '86.00' '70.00' '76.00' '65.00' '69.00' '60.00'
 '80.00' '54.00' '208.0' '155.0' '112.0' '92.00' '145.0' '137.0' '158.0'
 '167.0' '94.00' '107.0' '230.0' '49.00' '75.00' '91.00' '122.0' '67.00'
 '83.00' '78.00' '52.00' '61.00' '93.00' '148.0' '129.0' '96.00' '71.00'
 '98.00' '115.0' '53.00' '81.00' '79.00' '120.0' '152.0' '102.0' '108.0'
 '68.00' '58.00' '149.0' '89.00' '63.00' '48.00' '66.00' '139.0' '103.0'
 '125.0' '133.0' '138.0' '135.0' '142.0' '77.00' '62.00' '132.0' '84.00'
 '64.00' '74.00' '116.0' '82.00']

In [46]:
# 누락데이터 ('?') 삭제
import numpy as np
df['horsepower'].replace('?', np.nan, inplace=True)
# print(df.isnull().sum())
df.dropna(subset=['horsepower'], axis=0, inplace=True)
# print(df.isnull().sum())
# df.info()로 확인후 ['horsepower']데이터 타입을 float64
df['horsepower'] = df['horsepower'].astype('float64')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    int64
 8   name          392 non-null    object
 9   kpl           392 non-null    float64
dtypes: float64(6), int64(3), object(1)
memory usage: 33.7+ KB

In [47]:
# origin 열의 고유값을 확인
df['origin'].unique()

array([1, 3, 2], dtype=int64)

In [48]:
df['origin'].replace({1:'USA', 2:'EU', 3:'JAPAN'}, inplace = True)

In [49]:
df['origin'].unique()

array(['USA', 'JAPAN', 'EU'], dtype=object)

In [50]:
print(df['origin'].dtypes)

object

In [51]:
# origin 열의 문자열 자료형을 범주형으로 변환
df['origin'] = df['origin'].astype('category')
print(df['origin'].dtypes)

category

In [52]:
# origin 열의 카테고리 자료형을 다시 변환
# origin 열의 문자열 자료형을 범주형으로 변환
df['origin'] = df['origin'].astype('str')
print(df['origin'].dtypes)

object

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
 9   kpl           392 non-null    float64
dtypes: float64(6), int64(2), object(2)
memory usage: 33.7+ KB

In [54]:
# model year 정소룰 범수형으로 변환
df['model year'].sample(3) # 랜덤 샘플로 3개뽑기

364    81
165    75
200    76
Name: model year, dtype: int64

In [55]:
df['model year'] = df['model year'].astype('category')
df['model year'].sample(3)

227    77
143    74
204    76
Name: model year, dtype: category
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    float64
 5   acceleration  392 non-null    float64
 6   model year    392 non-null    category
 7   origin        392 non-null    object
 8   name          392 non-null    object
 9   kpl           392 non-null    float64
dtypes: category(1), float64(6), int64(1), object(2)
memory usage: 31.7+ KB

# Horsepower를 3개 등급으로 나누기

In [58]:
# np.histogram 함수로 3개의 bin으로 나누는 경계 값의 리스트 구하기
count, bin_dividers = np.histogram(df['horsepower'], bins=3)
print(bin_dividers)

[ 46.         107.33333333 168.66666667 230.        ]

In [59]:
# 3개의 bins에 이름지정
bin_name = ['저출력', '보통출력', '고출력']

In [60]:
# cut 함수로 각 데이터를 3개의 bin에 할당
df['hp_bin'] = pd.cut(x=df['horsepower'],
                     bins=bin_dividers, # 경계값 리스트
                     labels=bin_name, # 해당구간 이름
                     include_lowest=True) # 첫 경계값을 포함
print(df[['horsepower', 'hp_bin']]).head(10)

     horsepower hp_bin
0         130.0   보통출력
1         165.0   보통출력
2         150.0   보통출력
3         150.0   보통출력
4         140.0   보통출력
..          ...    ...
393        86.0    저출력
394        52.0    저출력
395        84.0    저출력
396        79.0    저출력
397        82.0    저출력

[392 rows x 2 columns]

AttributeError: 'NoneType' object has no attribute 'head'

In [61]:
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name,kpl,hp_bin
0,18.0,8,307.0,130.0,3504.0,12.0,70,USA,chevrolet chevelle malibu,7.65,보통출력
1,15.0,8,350.0,165.0,3693.0,11.5,70,USA,buick skylark 320,6.38,보통출력
2,18.0,8,318.0,150.0,3436.0,11.0,70,USA,plymouth satellite,7.65,보통출력

In [62]:
# hp_bin 열의 범주형 데이터를 더미변수로 변환(원핫인코딩)
horsepower_dummies = pd.get_dummies(df['hp_bin'])
print(horsepower_dummies.head(10))

   저출력  보통출력  고출력
0    0     1    0
1    0     1    0
2    0     1    0
3    0     1    0
4    0     1    0
5    0     0    1
6    0     0    1
7    0     0    1
8    0     0    1
9    0     0    1

In [63]:
pip install -U scikit-learn

Collecting scikit-learn
  Downloading scikit_learn-1.2.2-cp38-cp38-win_amd64.whl (8.3 MB)
     ---------------------------------------- 0.0/8.3 MB ? eta -:--:--
     --- ------------------------------------ 0.8/8.3 MB 16.6 MB/s eta 0:00:01
     ---------------- ----------------------- 3.3/8.3 MB 35.3 MB/s eta 0:00:01
     ---------------------------------------  8.3/8.3 MB 58.7 MB/s eta 0:00:01
     ---------------------------------------- 8.3/8.3 MB 44.3 MB/s eta 0:00:00
Collecting threadpoolctl>=2.0.0
  Downloading threadpoolctl-3.1.0-py3-none-any.whl (14 kB)
Collecting scipy>=1.3.2
  Downloading scipy-1.10.1-cp38-cp38-win_amd64.whl (42.2 MB)
     ---------------------------------------- 0.0/42.2 MB ? eta -:--:--
     --- ----------------------------------- 4.3/42.2 MB 132.8 MB/s eta 0:00:01
     -------- ------------------------------- 9.4/42.2 MB 99.6 MB/s eta 0:00:01
     ------------- ------------------------ 14.6/42.2 MB 108.8 MB/s eta 0:00:01
     ----------------- -------------------- 19.8/42.2 MB 110.0 MB/s eta 0:00:01
     ---------------------- --------------- 25.1/42.2 MB 131.2 MB/s eta 0:00:01
     -------------------------- ----------- 29.6/42.2 MB 129.5 MB/s eta 0:00:01
     ------------------------------ ------- 33.8/42.2 MB 110.0 MB/s eta 0:00:01
     ----------------------------------- --- 38.2/42.2 MB 93.9 MB/s eta 0:00:01
     --------------------------------------  42.2/42.2 MB 93.9 MB/s eta 0:00:01
     --------------------------------------  42.2/42.2 MB 93.9 MB/s eta 0:00:01
     --------------------------------------  42.2/42.2 MB 93.9 MB/s eta 0:00:01
     --------------------------------------  42.2/42.2 MB 93.9 MB/s eta 0:00:01
     --------------------------------------  42.2/42.2 MB 93.9 MB/s eta 0:00:01
     --------------------------------------- 42.2/42.2 MB 28.5 MB/s eta 0:00:00
Collecting joblib>=1.1.1
  Downloading joblib-1.2.0-py3-none-any.whl (297 kB)
     ---------------------------------------- 0.0/298.0 kB ? eta -:--:--
     ------------------------------------- 298.0/298.0 kB 18.0 MB/s eta 0:00:00
Requirement already satisfied: numpy>=1.17.3 in c:\python38\lib\site-packages (from scikit-learn) (1.24.2)
Installing collected packages: threadpoolctl, scipy, joblib, scikit-learn
Successfully installed joblib-1.2.0 scikit-learn-1.2.2 scipy-1.10.1 threadpoolctl-3.1.0
Note: you may need to restart the kernel to use updated packages.

In [1]:
# 원핫인코딩을 다른 패키지로 사용 가능
# sklearn 라이브러리 불러오기
from sklearn import preprocessing
#전처리를 위한 encoder객체 만들기
label_encoder = preprocessing.LabelEncoder()
onehot_encoder = preprocessing.OneHotEncoder()

In [11]:
import seaborn as sns
import pandas as pd
import numpy as np

In [12]:
df = sns.load_dataset('mpg')
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [13]:
df['horsepower'].replace('?', np.nan, inplace=True)
# print(df.isnull().sum())
df.dropna(subset=['horsepower'], axis=0, inplace=True)
# print(df.isnull().sum())
# df.info()로 확인후 ['horsepower']데이터 타입을 float64
df['horsepower'] = df['horsepower'].astype('float64')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    int64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 30.6+ KB

In [14]:
#label encoder로 문자열 범주를 숫자형 범주로 변환
onehot_labeled = label_encoder.fit_transform(df['hp_bin'].head(15))

KeyError: 'hp_bin'

In [15]:
print(onehot_labeled)

[60 78 72 72 67 85 90 89 91 83 80 77 72 91 41 41 43 31 34  0 33 36 41 53
 36 89 86 88 84 34 36 41 45 48 45 34 45 78 81 74 72 82 80 81 51 19 45 34
 32 36 17 22 12 16  7 17 41 26  5 36 32 78 81 72 74 72 87 75 77 83 43 72
 60 67 72 52 22 33 16 32 38 43 26 34 81 72 69 64 72 85 72 76 72 89 91 81
 48 45 45 34 41  0 72 79 80 82 45 34 19 40 36 31 49 36 69 92  2 21 37 52
 72 51 57 82 41 45 45 14 26 12 21 45 51 48 67 72 72 67 72 29 14 24  3  8
 21 21 21 43 39 14 41 48 19 19 80 69 72 70 51 48 51 41 51 51 59 21 29 45
 24 42 18 43 43 17 36 41 34 44 54  4 32 27 38 25 29 67 72 56 73 45 48 27
 36  3  7 17  4 45 24 51 41 18 17 21 19 46 72 34 50 56 82 69 60 72 15 26
  6 42 17 69 51 69 60 51 48 45 44 82 80 83 71 24 34 21 35 10 29 14 24 43
 51 51  1 13  3 17  7 51 67 66 48 41 31 34 45 36 48 31 51 56 69 78 66 67
 15 41 43 21 41 48 31 43 47 58 54 62 18 15 54 31 34 36 51 60 59 65 63 75
 68 58 72 18 12 26 26 23 58 18 36 17 17 12 16 36 54 54 36 22  7 17 12 36
 34 36 36 24 36 21 38 21 12 48 12  1  1 14 14 14 14  9 61 45 34 19 30 30
 38 51 30  6 11  7 14 12  9 15 10 12 12 20 21 21 45 20 26 22 55 56 51 48
 34 31 34 34 34 31 30 36 38 20 15 15 10 17 34 21 17 14 14 14 51 31 38 52
 42 30 36 32  3 30 25 28]

In [19]:
# 2차원 행렬형태
onehot_reshaped = onehot_labeled.reshape(len(onehot_labeled), 1)
print(onehot_reshaped)
print(type(onehot_reshaped))

[[60]
 [78]
 [72]
 [72]
 [67]
 [85]
 [90]
 [89]
 [91]
 [83]
 [80]
 [77]
 [72]
 [91]
 [41]
 [41]
 [43]
 [31]
 [34]
 [ 0]
 [33]
 [36]
 [41]
 [53]
 [36]
 [89]
 [86]
 [88]
 [84]
 [34]
 [36]
 [41]
 [45]
 [48]
 [45]
 [34]
 [45]
 [78]
 [81]
 [74]
 [72]
 [82]
 [80]
 [81]
 [51]
 [19]
 [45]
 [34]
 [32]
 [36]
 [17]
 [22]
 [12]
 [16]
 [ 7]
 [17]
 [41]
 [26]
 [ 5]
 [36]
 [32]
 [78]
 [81]
 [72]
 [74]
 [72]
 [87]
 [75]
 [77]
 [83]
 [43]
 [72]
 [60]
 [67]
 [72]
 [52]
 [22]
 [33]
 [16]
 [32]
 [38]
 [43]
 [26]
 [34]
 [81]
 [72]
 [69]
 [64]
 [72]
 [85]
 [72]
 [76]
 [72]
 [89]
 [91]
 [81]
 [48]
 [45]
 [45]
 [34]
 [41]
 [ 0]
 [72]
 [79]
 [80]
 [82]
 [45]
 [34]
 [19]
 [40]
 [36]
 [31]
 [49]
 [36]
 [69]
 [92]
 [ 2]
 [21]
 [37]
 [52]
 [72]
 [51]
 [57]
 [82]
 [41]
 [45]
 [45]
 [14]
 [26]
 [12]
 [21]
 [45]
 [51]
 [48]
 [67]
 [72]
 [72]
 [67]
 [72]
 [29]
 [14]
 [24]
 [ 3]
 [ 8]
 [21]
 [21]
 [21]
 [43]
 [39]
 [14]
 [41]
 [48]
 [19]
 [19]
 [80]
 [69]
 [72]
 [70]
 [51]
 [48]
 [51]
 [41]
 [51]
 [51]
 [59]
 [21]
 [29]
 [45]
 [24]
 [42]
 [18]
 [43]
 [43]
 [17]
 [36]
 [41]
 [34]
 [44]
 [54]
 [ 4]
 [32]
 [27]
 [38]
 [25]
 [29]
 [67]
 [72]
 [56]
 [73]
 [45]
 [48]
 [27]
 [36]
 [ 3]
 [ 7]
 [17]
 [ 4]
 [45]
 [24]
 [51]
 [41]
 [18]
 [17]
 [21]
 [19]
 [46]
 [72]
 [34]
 [50]
 [56]
 [82]
 [69]
 [60]
 [72]
 [15]
 [26]
 [ 6]
 [42]
 [17]
 [69]
 [51]
 [69]
 [60]
 [51]
 [48]
 [45]
 [44]
 [82]
 [80]
 [83]
 [71]
 [24]
 [34]
 [21]
 [35]
 [10]
 [29]
 [14]
 [24]
 [43]
 [51]
 [51]
 [ 1]
 [13]
 [ 3]
 [17]
 [ 7]
 [51]
 [67]
 [66]
 [48]
 [41]
 [31]
 [34]
 [45]
 [36]
 [48]
 [31]
 [51]
 [56]
 [69]
 [78]
 [66]
 [67]
 [15]
 [41]
 [43]
 [21]
 [41]
 [48]
 [31]
 [43]
 [47]
 [58]
 [54]
 [62]
 [18]
 [15]
 [54]
 [31]
 [34]
 [36]
 [51]
 [60]
 [59]
 [65]
 [63]
 [75]
 [68]
 [58]
 [72]
 [18]
 [12]
 [26]
 [26]
 [23]
 [58]
 [18]
 [36]
 [17]
 [17]
 [12]
 [16]
 [36]
 [54]
 [54]
 [36]
 [22]
 [ 7]
 [17]
 [12]
 [36]
 [34]
 [36]
 [36]
 [24]
 [36]
 [21]
 [38]
 [21]
 [12]
 [48]
 [12]
 [ 1]
 [ 1]
 [14]
 [14]
 [14]
 [14]
 [ 9]
 [61]
 [45]
 [34]
 [19]
 [30]
 [30]
 [38]
 [51]
 [30]
 [ 6]
 [11]
 [ 7]
 [14]
 [12]
 [ 9]
 [15]
 [10]
 [12]
 [12]
 [20]
 [21]
 [21]
 [45]
 [20]
 [26]
 [22]
 [55]
 [56]
 [51]
 [48]
 [34]
 [31]
 [34]
 [34]
 [34]
 [31]
 [30]
 [36]
 [38]
 [20]
 [15]
 [15]
 [10]
 [17]
 [34]
 [21]
 [17]
 [14]
 [14]
 [14]
 [51]
 [31]
 [38]
 [52]
 [42]
 [30]
 [36]
 [32]
 [ 3]
 [30]
 [25]
 [28]]
<class 'numpy.ndarray'>

In [18]:
# 희소 행렬로 변환
onehot_fitted = onehot_encoder.fit_transform(onehot_reshaped)
print(onehot_fitted)

  (0, 60)	1.0
  (1, 78)	1.0
  (2, 72)	1.0
  (3, 72)	1.0
  (4, 67)	1.0
  (5, 85)	1.0
  (6, 90)	1.0
  (7, 89)	1.0
  (8, 91)	1.0
  (9, 83)	1.0
  (10, 80)	1.0
  (11, 77)	1.0
  (12, 72)	1.0
  (13, 91)	1.0
  (14, 41)	1.0
  (15, 41)	1.0
  (16, 43)	1.0
  (17, 31)	1.0
  (18, 34)	1.0
  (19, 0)	1.0
  (20, 33)	1.0
  (21, 36)	1.0
  (22, 41)	1.0
  (23, 53)	1.0
  (24, 36)	1.0
  :	:
  (367, 36)	1.0
  (368, 38)	1.0
  (369, 20)	1.0
  (370, 15)	1.0
  (371, 15)	1.0
  (372, 10)	1.0
  (373, 17)	1.0
  (374, 34)	1.0
  (375, 21)	1.0
  (376, 17)	1.0
  (377, 14)	1.0
  (378, 14)	1.0
  (379, 14)	1.0
  (380, 51)	1.0
  (381, 31)	1.0
  (382, 38)	1.0
  (383, 52)	1.0
  (384, 42)	1.0
  (385, 30)	1.0
  (386, 36)	1.0
  (387, 32)	1.0
  (388, 3)	1.0
  (389, 30)	1.0
  (390, 25)	1.0
  (391, 28)	1.0

# time_series

In [20]:
df = pd.read_csv('./data1/stock-data.csv')

In [21]:
df.head(4)

         Date  Close  Start   High    Low  Volume
0  2018-07-02  10100  10850  10900  10000  137977
1  2018-06-29  10700  10550  10900   9990  170253
2  2018-06-28  10400  10900  10950  10150  155769
3  2018-06-27  10900  10800  11050  10500  133548

In [22]:
df['new_date'] = pd.to_datetime(df['Date'])

In [23]:
df.head(2)

         Date  Close  Start   High    Low  Volume   new_date
0  2018-07-02  10100  10850  10900  10000  137977 2018-07-02
1  2018-06-29  10700  10550  10900   9990  170253 2018-06-29

In [24]:
df.set_index('new_date', inplace=True)

In [25]:
df.drop('Date', axis=1, inplace=True)

In [26]:
df.head(3)

            Close  Start   High    Low  Volume
new_date
2018-07-02  10100  10850  10900  10000  137977
2018-06-29  10700  10550  10900   9990  170253
2018-06-28  10400  10900  10950  10150  155769

In [27]:
dates = ['2019-01-01', '2020-03-01', '2021-06-01']
ts_dates = pd.to_datetime(dates)
print(ts_dates)

DatetimeIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='datetime64[ns]', freq=None)

In [33]:
# Timestamp를 period로 변환
pr_day = ts_dates.to_period(freq='D')
print(pr_day)
pr_month = ts_dates.to_period(freq='M')
print(pr_month)
pr_year = ts_dates.to_period(freq='A')
print(pr_year)

PeriodIndex(['2019-01-01', '2020-03-01', '2021-06-01'], dtype='period[D]')
PeriodIndex(['2019-01', '2020-03', '2021-06'], dtype='period[M]')
PeriodIndex(['2019', '2020', '2021'], dtype='period[A-DEC]')

In [34]:
# Timestamp의 배열 만들기 - 월간격, 월의시작일 기준
ts_ms = pd.date_range(start='2019-01-01', # 날짜범위 시작
                     end = None, # 날짜범위 끝
                     periods=6, #생성할 timestamp의 개수
                     freq='MS', # 시간간격 MS : 월의 시작일
                     tz = 'Asia/Seoul') # 시간대 지역
print(len(ts_ms))
print(ts_ms)

6
DatetimeIndex(['2019-01-01 00:00:00+09:00', '2019-02-01 00:00:00+09:00',
               '2019-03-01 00:00:00+09:00', '2019-04-01 00:00:00+09:00',
               '2019-05-01 00:00:00+09:00', '2019-06-01 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='MS')

In [38]:
# 월간격, 월의 마지막 날 기준
ts_me = pd.date_range(start='2019-01-01',
                      periods=6,
                      freq='M',
                      tz='Asia/Seoul')
print(len(ts_me))
print(ts_me)

6
DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-02-28 00:00:00+09:00',
               '2019-03-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-05-31 00:00:00+09:00', '2019-06-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='M')

In [39]:
# 분기(3개월), 간격, 월의 마지막날 기준
ts_3me = pd.date_range(start='2019-01-01',
                      periods=6,
                      freq='3M',
                      tz='Asia/Seoul')
print(len(ts_3me))
print(ts_3me)

6
DatetimeIndex(['2019-01-31 00:00:00+09:00', '2019-04-30 00:00:00+09:00',
               '2019-07-31 00:00:00+09:00', '2019-10-31 00:00:00+09:00',
               '2020-01-31 00:00:00+09:00', '2020-04-30 00:00:00+09:00'],
              dtype='datetime64[ns, Asia/Seoul]', freq='3M')